
// Наслідування.

namespace Inheritance
{
    class DerivedClass : BaseClass
    {
        public int derivedField;

        // Конструктор за замовчуванням.
        public DerivedClass()
        {
        }

        // Користувацький конструктор.
        // При створенні об'єкта похідного класу, конструктор похідного класу
        // автоматично викликає конструктор за замовчуванням з базового класу.
        // Конструктор базового класу, присвоїть всім даними якісь свої дефолтні або безпечні значення.
        // Після цього почне роботу конструктор похідного класу, який повторно
        // визначатиме значення для успадкованих членів. (ПОДВІЙНА РОБОТА)!
        public DerivedClass(int number1, int number2)
        {
            // Ініціалізовуємо поле базового класу.
            baseNumber = number1;

            // Ініціалізовуємо поле похідного (даного) класу.
            derivedField = number2;
        }
    }
}
