using System;

// Наслідування.

// Наслідування - механізм об'єктно-орієнтованого програмування, що дозволяє описати новий (похідний) клас
// на основі вже існуючого (базового),
// при цьому властивості і функціональність базового класу запозичуються новим похідним класом.

// Базовий клас - Похідний клас
// Супер клас - Підклас або (сабкласс)
// Батьківський клас - Дочірній клас
// Батько - Нащадок

namespace Inheritance
{
    class Program
    {
        static void Main()
        {
            DerivedClass instance = new DerivedClass();

            Console.WriteLine(instance.publicField);

            // Delay.
            Console.ReadKey();
        }
    }
}
